In [1]:
import sqlite3
from sqlalchemy import create_engine
import pandas as pd
import glob

In [2]:
path="F:/1_Bachelorarbeit/1_Daten/1_Yellow_Cab_Trips_2009-June_2016/4_Sqlite/NYC_Yellow_Cab_Tripdata"
# Create Database or if Name is there open Database
connection = sqlite3.connect(path)
# Create Cursor for SQL-Commands
cursor=connection.cursor()

In [3]:
# Drop Weather Table
dropTableStatement = "DROP TABLE weather_data"
cursor.execute(dropTableStatement)

In [4]:
# First Create Table for NOAA Weather Data
sql_command= "CREATE TABLE weather_data (Weather_ID INTEGER PRIMARY KEY AUTOINCREMENT, DATE TIMESTAMP,TAVG REAL, TMAX REAL, TMIN REAL,WT01 INTEGER,WT11 INTEGER,WT16 INTEGER,WT18 INTEGER);"
cursor.execute(sql_command)

In [5]:
#Path for Weather_Data
path_weather_data="F:/1_Bachelorarbeit/1_Daten/2_NOAA_Weather_Data_2009-June2016/Daily_Summary_Central_Park.csv"

In [6]:
# Columns to read from parquet File
columns=["DATE","TAVG","TMAX","TMIN","WT01","WT11","WT16","WT18"]

In [7]:
# Load all Parquet File with selected Columns in Dataframe and load to sqlite
df=pd.read_csv(path_weather_data, usecols=columns)
df.to_sql(name="weather_data", con=connection, if_exists="append", index=False)

In [8]:
# Look into Table to confirm that the data are loaded
sql = "SELECT * FROM weather_data LIMIT 10;"  
df = pd.read_sql_query(sql, connection)
df.head(10)

   Weather_ID        DATE  TAVG  TMAX  TMIN  WT01  WT11  WT16  WT18
0           1  2009-01-01  None  26.0  15.0   NaN  None   NaN   NaN
1           2  2009-01-02  None  34.0  23.0   NaN  None   1.0   1.0
2           3  2009-01-03  None  38.0  29.0   NaN  None   NaN   1.0
3           4  2009-01-04  None  42.0  25.0   NaN  None   NaN   NaN
4           5  2009-01-05  None  43.0  38.0   NaN  None   1.0   NaN
5           6  2009-01-06  None  38.0  31.0   1.0  None   1.0   NaN
6           7  2009-01-07  None  38.0  31.0   1.0  None   1.0   NaN
7           8  2009-01-08  None  38.0  29.0   NaN  None   NaN   NaN
8           9  2009-01-09  None  32.0  26.0   NaN  None   NaN   NaN
9          10  2009-01-10  None  30.0  23.0   1.0  None   1.0   1.0

In [9]:
sql="SELECT COUNT(*) FROM weather_data" 
pd.read_sql_query(sql, connection)

   COUNT(*)
0      2738